const { postTip } = require("../services/tip.service")
exports.postTips = async (req, res) => {
    /*========================================================================================================
    #swagger.tags = ['Tip']
    #swagger.summary = '버그 리포트'
    #swagger.description = '버그 리포트를 요청하면 로그를 남긴다.'
    ========================================================================================================*/
    try {
        const { dataId } = req.body
        const { userId } = res.locals
        postTip(userId, dataId)
        /*=====================================================================================
        #swagger.responses[201] = {
            description: '정상적으로 값을 받았을 때, 아래 예제와 같은 형태로 응답받습니다.',
            schema: { result: "SUCCESS", message: "상세페이지 조회 성공" }
        }
        =====================================================================================*/
        res.status(200).json({ result: "SUCCESS", message: "버그 리포트 성공" })
    } catch (err) {
        /*=====================================================================================
        #swagger.responses[400] = {
            description: '정상적으로 값을 받지 못했을 때, 아래 예제와 같은 형태로 응답받습니다.',
            schema: { result: "FAIL", message: "상세페이지 조회 실패" }
        }
        =====================================================================================*/
        res.status(400).json({ result: "FAIL", message: "버그 리포트 실패" })
    }
}
